---
title: RevitLinkOptions
classe: Autodesk.Revit.DB.RevitLinkOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# RevitLinkOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsRelative { get; set; }` | `revitLinkOptions.IsRelative` | Boolean |
| `Boolean IsValidObject { get; }` | `revitLinkOptions.IsValidObject` | Boolean |
| `Void Dispose()` | `revitLinkOptions.Dispose()` | Void |
| `WorksetConfiguration GetWorksetConfiguration()` | `revitLinkOptions.GetWorksetConfiguration()` | WorksetConfiguration |
| `Void SetWorksetConfiguration(WorksetConfiguration)` | `revitLinkOptions.SetWorksetConfiguration(config)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```